In [1]:
# let us import the Pandas Library

import pandas as pd

In [5]:
#Define a dictionary 'x'

x = {'Name':['Rose', 'Jhon', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
    'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame

df = pd.DataFrame(x)
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  Jhon   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [19]:
#Retrieving the "ID" column and assigning it to a variable x

x1 = df[['ID']]
x1

   ID
0   1
1   2
2   3
3   4

In [20]:
x2 = df[['Salary']]
x2

   Salary
0  100000
1   80000
2   50000
3   60000

In [21]:
#check the type of x
type(x2)

pandas.core.frame.DataFrame

In [23]:
#check the type of x
type(x1)

pandas.core.frame.DataFrame

In [24]:
#Retrieving the Department, Salary and ID columns and assigning it to a variable z

z = df[['Salary', 'Department', 'ID']]
z

   Salary       Department  ID
0  100000  Architect Group   1
1   80000   Software Group   2
2   50000      Design Team   3
3   60000   Infrastructure   4